{ "format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.0.0", "modelTopology": { "keras_version": "2.4.0", "backend": "tensorflow", "model_config": { "class_name": "Sequential", "config": { "name": "sequential_25", "layers": [{ "class_name": "InputLayer", "config": { "batch_input_shape": [null, 13], "dtype": "float32", "sparse": false, "ragged": false, "name": "dense_43_input" } }, { "class_name": "Dense", "config": { "name": "dense_43", "trainable": true, "batch_input_shape": [null, 13], "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": { "class_name": "GlorotUniform", "config": { "seed": null } }, "bias_initializer": { "class_name": "Zeros", "config": {} }, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null } }, { "class_name": "Dropout", "config": { "name": "dropout_23", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null } }, { "class_name": "Dense", "config": { "name": "dense_44", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": { "class_name": "GlorotUniform", "config": { "seed": null } }, "bias_initializer": { "class_name": "Zeros", "config": {} }, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null } }] } }, "training_config": { "loss": "binary_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "loss_weights": null, "optimizer_config": { "class_name": "Adam", "config": { "name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false } } } }, "weightsManifest": [{ "paths": ["heart-group1-shard1of1.bin"], "weights": [{ "name": "dense_43/kernel", "shape": [13, 32], "dtype": "float32" }, { "name": "dense_43/bias", "shape": [32], "dtype": "float32" }, { "name": "dense_44/kernel", "shape": [32, 1], "dtype": "float32" }, { "name": "dense_44/bias", "shape": [1], "dtype": "float32" }] }] }